{
    "_name_or_path": "zphang/pegasus-x-base",
    "activation_dropout": 0.1,
    "activation_function": "relu",
    "add_bias_logits": false,
    "add_final_layer_norm": true,
    "architectures": [
      "PegasusXForConditionalGeneration"
    ],
    "attention_dropout": 0.1,
    "block_size": 512,
    "bos_token_id": 0,
    "classif_dropout": 0.0,
    "classifier_dropout": 0.0,
    "d_model": 768,
    "decoder_attention_heads": 12,
    "decoder_ffn_dim": 3072,
    "decoder_layerdrop": 0.0,
    "decoder_layers": 12,
    "decoder_start_token_id": 0,
    "dropout": 0.1,
    "encoder_attention_heads": 12,
    "encoder_ffn_dim": 3072,
    "encoder_layerdrop": 0.0,
    "encoder_layers": 12,
    "eos_token_id": 1,
    "extra_pos_embeddings": 1,
    "force_bos_token_to_be_generated": false,
    "forced_eos_token_id": 1,
    "gradient_checkpointing": false,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1",
      "2": "LABEL_2"
    },
    "init_std": 0.02,
    "is_encoder_decoder": true,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1,
      "LABEL_2": 2
    },
    "length_penalty": 0.8,
    "max_length": 2048,
    "max_position_embeddings": 2048,
    "model_type": "pegasus_x",
    "normalize_before": true,
    "normalize_embedding": false,
    "num_beams": 8,
    "num_global_tokens": 128,
    "num_hidden_layers": 12,
    "pad_token_id": 0,
    "scale_embedding": true,
    "stagger_local_blocks": true,
    "static_position_embeddings": true,
    "torch_dtype": "float32",
    "transformers_version": "4.22.0.dev0",
    "use_cache": true,
    "vocab_size": 96103
  }